Revit 2024 API
FamilyLoadedIntoDocumentEventArgs.OriginalFamilyId Property
 The original family id that is overridden by the newly loaded family.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public ElementId OriginalFamilyId { get; }
Visual Basic
Public ReadOnly Property OriginalFamilyId As ElementId
	Get
Visual C++
public:
property ElementId^ OriginalFamilyId {
	ElementId^ get ();
}
See Also
FamilyLoadedIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace